In [1]:
import pandas as pd
import numpy as np

In [2]:
##Readind data from csv file
df=pd.read_csv('tips.csv')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [3]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [4]:
df.columns=['a', 'b', 'c', 'd', 'e', 'f', 'g']
df.head()

       a     b       c   d    e       f  g
0  16.99  1.01  Female  No  Sun  Dinner  2
1  10.34  1.66    Male  No  Sun  Dinner  3
2  21.01  3.50    Male  No  Sun  Dinner  3
3  23.68  3.31    Male  No  Sun  Dinner  2
4  24.59  3.61  Female  No  Sun  Dinner  4

In [5]:
df1=pd.read_excel('tips.xlsx')
df1.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
df2=pd.read_json('tips.json')
df2.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
df['c'][0]

'Female'

In [8]:
## reading from variables
dict_row = [{'BMI': 21.1, 'insulin': 50, 'BP': 66},
            {'BMI': 24.4, 'insulin': 72, 'BP': 54},
            {'BMI': 20.9, 'insulin': 24, 'BP': 78}]
pd.DataFrame(dict_row)

    BMI  insulin  BP
0  21.1       50  66
1  24.4       72  54
2  20.9       24  78

In [9]:
dict_column={'a':[1,2,3,4],
            'b':[5,6,7,8],
            'c':[1,4,6,8]}
pd.DataFrame(dict_column)

   a  b  c
0  1  5  1
1  2  6  4
2  3  7  6
3  4  8  8

In [10]:
## list from row oriented
records=[(10,20,30),
        (24,36,38),
        (12,34,56)]
column_labels=['A','B','C']
pd.DataFrame.from_records(records,columns=column_labels)

    A   B   C
0  10  20  30
1  24  36  38
2  12  34  56

In [11]:
## list from column oriented
item_ = [('BMI', [21.1, 24.4, 20.9]),
        ('insulin', [50, 72, 24]),
        ('BP', [66, 54, 78])]
pd.DataFrame(item_)

         0                   1
0      BMI  [21.1, 24.4, 20.9]
1  insulin        [50, 72, 24]
2       BP        [66, 54, 78]

In [12]:
## copying data
df=df1
print(id(df))
print(id(df1))

3196833066480
3196833066480

In [13]:
#shallow copy
df2=df.copy(deep=False)
print(id(df2))
print(id(df))

3196888511488
3196833066480

In [14]:
## Deep copy
df1=df.copy(deep=True)
print(id(df))
print(id(df1))

3196833066480
3196888511248

In [15]:
## pandas series
dfs=pd.Series([1,2,4,6,'a','b'],name='Series')
dfs

0    1
1    2
2    4
3    6
4    a
5    b
Name: Series, dtype: object

In [16]:
df2['tip'][:5]

0    1.01
1    1.66
2    3.50
3    3.31
4    3.61
Name: tip, dtype: float64

In [17]:
type(df['tip'])

pandas.core.series.Series

In [18]:
print(type(df2['tip']))
print(type(df2[['tip']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>